# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

i=int(input("Введите 3-х значное число: "))
print(f"{i//100+(i%100)//10+i%10} -> ({i//100}+{(i%100)//10}+{i%10})")